ip-mirth/src/test/resources/CanonicalModelProcessorMC_sample.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns3:caCISRequest xmlns:ns2="urn:hl7-org:v3" xmlns:ns3="http://cacis.nci.nih.gov">
            <ns3:clinicalMetaData documentType="CLINICAL_NOTE" siteIdRoot="2.3.4.0" patientIdRoot="2.3.4.1" siteIdExtension="mc_site_id" patientIdExtension="mc_patient_id" studyIdRoot="2.3.4.2" studyIdExtension="mc_study_id"/>
            <ns2:ClinicalDocument>
                <ns2:id root="123" extension="123"/>
            </ns2:ClinicalDocument>
        </ns3:caCISRequest>
    </soap:Body>
</soap:Envelope>